Repository: mokhiya/NajotFeed
Catalog: locale/*/LC_MESSAGES/django.po
Languages: uz

source: Offers
uz: Takliflar

source: Offer
uz: Taklif

source: Problems
uz: Muammolar

source: Problem
uz: Muammo

source: ProblemComments
uz: ShikoyatIzohlari

source: ProblemComment
uz: MuammoIzohi

source: OfferComments
uz: TaklifIzohlari

source: OfferComment
uz: TaklifIzohi

source: FAQs
uz: TTSlar

source: FAQ
uz: TTS

source: Log out
uz: Chiqish

source: Log in
uz: Kirish

source: Home
uz: Asosiy

source: Comments
uz: Izohlar

source: Exchange of ideas
uz: Fikrlar almashinuvi

source: Online platform for requests and offers
uz: So'rov va takliflar uchun onlayn platforma

source: Make an offer
uz: Taklif berish

source: Brief information about the site
uz: Sayt haqida qisqacha

source: Najot Ta'lim Feedback
uz: Najot Ta'lim Fikrlar

source: The Najot Ta'lim Feedback Site is designed to collect and analyze feedback on services, classes, and overall experiences at the Najot Ta'lim educational center. The site allows students and their parents to identify strengths and areas for improvement at the center. Feedback is gathered through an online form, enhancing transparency and openness. The collected feedback is used to improve services and introduce new opportunities. The site also showcases the centerâ€™s achievements and successes, providing inspiration and strengthening its image.
uz: The Najot Ta'lim Feedback sayti ko'rsatilayotgan xizmatlar uchun firklarni to'plash va tahlil qilish, darslar bo'yicha berilgan fikrlarni ko'rsatish uchun mo'ljallangan. Sayt talabalar va ularning ota onalariga o'quv markazi bo'yicha fikrrlarni ko'rish va uni yaxshilash uchun taklif berish imkoniyatini taqdim etadi. Barcha fikrlar onlayn so'rovnoma orqali, shaffoflik va anonimlikni ta'minlagan holda to'planadi. The Jamlangan fikrlar markaz faoliyatini yaxshilash uchun ko'rib chiqiladi. Sayt, shuningdek, markaz obro'sini kuchaytirishga qaratilgan yutuqlarni o'zida aks ettiradi.

source: Questions - Answers
uz: Savol-Javoblar

source: Frequently asked questions
uz: Takroran so'raluvchi savollar

source: Question
uz: Savol

source: Team
uz: Jamoa

source: About the participants in the team
uz: Jamoa a'zolari haqida

source: Appeals
uz: Arizalar

source: Best offers
uz: Eng yaxshi takliflar

source: Terms
uz: Shartlar

source: Privacy Policy
uz: Daxlsizlik siyosati

source: Contact
uz: Bog'lanish

source: Welcome to
uz: Xush kelibsiz

source: Login
uz: Kirish

source: Does your account not exist?
uz: Akkauntingiz mavjud emasmi?

source: Create account
uz: Akkaunt yaratish

source: Register
uz: Ro'yxatdan o'tish

source: First name
uz: Ism

source: Last name
uz: Familiya

source: Email
uz: Elektron pochta

source: Username
uz: Foydalanuvchi

source: Password
uz: Parol

source: Do you have an account?
uz: Akkauntingiz allaqachon mavjudmi?

source: Najot Ta'lim | Comment
uz: Najot Ta'lim | Izohlar

source: Who wrote a comment
uz: Izoh kim tomonidan qoldirildi

source: Offer title
uz: Taklif nomi

source: Submit a problem
uz: Muammoni yuborish

source: Title
uz: Mavzu

source: Enter problem title
uz: Taklif nomini kiriting

source: Description
uz: Bayon

source: Enter problem description
uz: Muammo bayonini kiriting

source: Submit
uz: Yuborish

source: Submit an offer
uz: Taklifni yuborish

source: Enter offer title
uz: Taklif nomini kiriting

source: Enter offer description
uz: Taklif bayonini kiriting

source: Write an offer
uz: Taklifni yuborish

source: Landing page
uz: Bosh sahifa

source: Profile
uz: Profil

source: Show Offers
uz: Takliflarni ko'rsatish

source: Show Demands
uz: Talablarni ko'rsatish

source: Show My Offers
uz: Mening takliflarim

source: Show My Written Comments
uz: Mening yozma izolarim

source: The Site
uz: Sayt haqida

source: Profile Picture
uz: Profil rasmi

source: JPG or PNG no larger than 5 MB
uz: JPG yoki PNG rasm yuklash, 5mb dan oshmasin

source: Upload new image
uz: Yangi rasm yuklash

source: Account Details
uz: Akkaunt ma'lumotlari

source: Username (how your name will appear to other users on the site)
uz: Foydalanuvchi ismi (siz boshqalarga shu ism orqali ko'rinasiz)

source: Enter your username
uz: Foydalanuvchi ismini kiriting

source: Enter your first name
uz: Ismingizni kiriting

source: Enter your last name
uz: Familiyangizni kiriting

source: Organization name
uz: Tashkilot nomi

source: Enter your organization name
uz: Tashkilot nomini kiriting

source: Location
uz: Manzil

source: Enter your location
uz: Manzilingizni kiriting

source: Email address
uz: Elektron pochta

source: Enter your email address
uz: Elektron pochtangizni yozing

source: LinkedIn profile link
uz: LinkedIn sahifasi

source: Enter your LinkedIn account
uz: LinkedIn sahifasiga havola bering

source: Save changes
uz: O'zgarishlarni saqlash

source: User
uz: Foydalanuvchi

source: Users
uz: Foydalanuvchilar

source: TeamMember
uz: JamoaAzosi

source: TeamMembers
uz: JamoaAzolari
